### Setup

In [1]:
import pandas as pd

### Our data

In [2]:
bd_weather = pd.DataFrame({
    'city': ['Dhaka', 'Chittagong', 'Rajshahi'],
    'temp': [34, 33, 30],
    'humidity': [80, 72, 65]
})
bd_weather

         city  temp  humidity
0       Dhaka    34        80
1  Chittagong    33        72
2    Rajshahi    30        65

In [3]:
us_weather = pd.DataFrame({
    'city': ['New York', 'Chicago', 'Boston'],
    'temp': [21, 14, 27],
    'humidity': [63, 55, 61]
})
us_weather

       city  temp  humidity
0  New York    21        63
1   Chicago    14        55
2    Boston    27        61

In [4]:
ind_weather = pd.DataFrame({
    'city': ['Mumbai', 'Delhi', 'Bangalore'],
    'temp': [32, 43, 33],
    'humidity': [85, 78, 80]
})
ind_weather

        city  temp  humidity
0     Mumbai    32        85
1      Delhi    43        78
2  Bangalore    33        80

# Concatinating DataFrames
Concatination simply means joining to the end of the rows. So when we join these __three DataFrames__, we join them end to end in the given order.

In [5]:
df = pd.concat([bd_weather, ind_weather, us_weather])
df

         city  temp  humidity
0       Dhaka    34        80
1  Chittagong    33        72
2    Rajshahi    30        65
0      Mumbai    32        85
1       Delhi    43        78
2   Bangalore    33        80
0    New York    21        63
1     Chicago    14        55
2      Boston    27        61

If we want to keep a __continuous index__ we can set the `ignore_index` kwarg to `True`.

In [6]:
df = pd.concat([bd_weather, ind_weather, us_weather], ignore_index=True)
df

         city  temp  humidity
0       Dhaka    34        80
1  Chittagong    33        72
2    Rajshahi    30        65
3      Mumbai    32        85
4       Delhi    43        78
5   Bangalore    33        80
6    New York    21        63
7     Chicago    14        55
8      Boston    27        61

We can also have a __Multi level index__ (`MultiIndex`) as our row index, by specifying the names of the groups in the `keys`kwarg.

In [7]:
df = pd.concat([bd_weather, ind_weather, us_weather], keys=['Bangladesh', 'India', 'USA'])
df

                    city  temp  humidity
Bangladesh 0       Dhaka    34        80
           1  Chittagong    33        72
           2    Rajshahi    30        65
India      0      Mumbai    32        85
           1       Delhi    43        78
           2   Bangalore    33        80
USA        0    New York    21        63
           1     Chicago    14        55
           2      Boston    27        61

Normal indexing is for columns

In [10]:
df['temp']

Bangladesh  0    34
            1    33
            2    30
India       0    32
            1    43
            2    33
USA         0    21
            1    14
            2    27
Name: temp, dtype: int64

Use `df.loc` followed by the name of the row group to get that groups rows.

In [9]:
df.loc['USA']

       city  temp  humidity
0  New York    21        63
1   Chicago    14        55
2    Boston    27        61